import UIKit
/*შექმენით სამი Int ტიპის ცვლადი, მიანიჭეთ მათ მნიშვნელობა
 და დაბეჭდეთ მათი ნამრავლი.*/
var number1: Int
var number2: Int
var number3: Int
number1=5
number2=2
number3=1
print(number1*number2*number3)
/*შექმენით int ტიპის ცვლადი, მიანიჭეთ მას მნიშვნელობა და შეამოწმეთ ეს რიცხვი ლუწია თუ კენტი
 ტერნარი ოპერატორით.*/
var number4 = 6
print(number4%2 == 1 ? "კენტია" : "ლუწია")
/*შექმენით optional String-ის ტიპის და მიანიჭეთ თქვენი სახელის მნიშვნელობა. If let-ის მეშვეობით
 გაუკეთეთ unwrap და მნიშვნელობა დაპრინტეთ*/
var name : String?
name = "ნუცა"
if let name{
    print(name)
}
else{
    print("სახელი ვერ მოიძებნა")
}
/*შექმენით ცვლადი სახელად isRaining ბულეანის ტიპის და მიანიჭეთ თქვენთვის სასურველი მნიშვნელობა. If-else-ის მეშვეობით შეამოწმეთ თუ მნიშვნელობა მიიღებს true მნიშვნელობას დაბეჭდეთ “ქოლგის წაღება არ დამავიწყდეს”, სხვა შემთხვევაში “დღეს ქოლგა არ დამჭირდება”.*/
var isRaining : Bool
isRaining = false
if isRaining{
    print("ქოლგის წაღება არ დამავიწყდეს")
}
else{
    print("დღეს ქოლგა არ დამჭირდება")
}
/*  შექმენით ორი int ტიპის ცვლადი a & b და მიანიჭეთ სასურველი რიცხვები. If-else-ით შეამოწმეთ თუ a მეტია b-ზე დაბეჭდეთ “a მეტია”,  სხვა შემთხვევაში “b მეტია”  */
var a: Int
var b: Int
a = 4
b = 3
if a>b{
    print("a მეტია")
}
else{
    //აქ პირობას მივყევი თუმცა ჩემი აზრით ტოლობაც უნდა გაგვეთვალისინებინა
    print("b მეტია")
}
/* შექმენით მუდმივა Character ტიპის და მიანიჭეთ თქვენი სახელის პირველი ასოს მნიშვნელობა.   */
let character : Character
character = "n"
/*  მოცემულია ორნიშნა რიცხვი, გაიგეთ არის თუ არა ერთიდაიმავე ციფრისგან შემდგარი*/
var unknownNumber = 55
if unknownNumber % 10 == unknownNumber/10{
    print("ერთი და იმავე ციფრებისგან შედგება")
}
else{
    print("ერთი და იმავე ციფრებისგან არ შედგება")
}

/* აიღეთ ცვლადი numberOfMonths მიანიჭეთ მნიშვნელობა და იმის მიხედვით თუ მერამდენე თვეა დაბეჭდეთ ის (გაზაფხული, ზაფხული, შემოდგომა, ზამთარი) შესაბამისად.*/
var numberOfMonths = 3
if numberOfMonths <= 2 || numberOfMonths == 12 {
print("ზამთარი")
}
else if numberOfMonths <= 5{
    
    print("გაზაფხული")
}
else if numberOfMonths <= 8{
            print("ზაფხული")
        }
else{
            print("შემოდგომა")
        }
/* შექმენით მთელი რიცხვის მქონე ცვლადი. თუ ეს ცვლადი იყოფა 3-ზე, დაბეჭდეთ “იყოფა 3-ზე”, თუ ეს ცვლადი იყოფა 4-ზე დაბეჭდეთ “იყოფა 4-ზე”, თუ იყოფა ორივეზე დაბეჭდეთ “იყოფა 3-ზე და 4-ზე”*/
var number5 = 8
if number5%3 == 0{
    if number5%4 == 0 {
        print("იყოფა 3-ზე და 4-ზე")
    } else {
        print("იყოფა 3-ზე")
    }
    
}
else if number5%4 == 0 {
    print("იყოფა 4-ზე")
    
}

/* შექმენით ორი რიცხვითი ცვლადი num1, num2 და რაიმე String ტიპის ცვლადი რომელსაც ტერნარული ოპერატორის საშუალებით მიანიჭებთ “თანაბრად დაშორებულია ნულიდან” / “არ არის თანაბრად დაშორებული ნულიდან” შესაბამის მნიშვნელობას რომელსაც აკმაყოფილებს მოცემული ორი ცვლადი
 */
var statement : String
var num1 = -7
var num2 = 7
statement = num1/num2 == 1 || num1/num2 == -1 ? "თანაბრად დაშორებულია ნულიდან" : "არ არის თანაბრად დაშორებული ნულიდან"
